recharge/templates/payloads/Recharge.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ars="http://www.huawei.com/bme/cbsinterface/arservices" xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:arc="http://cbs.huawei.com/ar/wsservice/arcommon">
   <soapenv:Header/>
   <soapenv:Body>
      <ars:RechargeRequestMsg>
         <RequestHeader>
            <cbs:Version>1</cbs:Version>
            <cbs:BusinessCode>?</cbs:BusinessCode>
            <cbs:MessageSeq>$datetime</cbs:MessageSeq>
            <cbs:AccessSecurity>
               <cbs:LoginSystemCode>102</cbs:LoginSystemCode>
               <cbs:Password>7/PuyYwNpRtSX7jDpxnl2ECAvuVYH2Mu9zxqgPGJrPYYK73MCZN7DvrDepA=</cbs:Password>
            </cbs:AccessSecurity>
            <cbs:OperatorInfo>
               <cbs:OperatorID>101</cbs:OperatorID>
            </cbs:OperatorInfo>
         </RequestHeader>
         <RechargeRequest>
            <ars:RechargeObj>
               <ars:SubAccessCode>
                  <arc:PrimaryIdentity>$msisdn</arc:PrimaryIdentity>
               </ars:SubAccessCode>
            </ars:RechargeObj>
            <ars:RechargeInfo>
               <ars:CashPayment>
                  <ars:PaymentMethod>$paymentMethod</ars:PaymentMethod>
                  <ars:Amount>$amount</ars:Amount>
                  <ars:BankInfo>
                     <arc:BankCode>$bankId</arc:BankCode>
                  </ars:BankInfo>
               </ars:CashPayment>
            </ars:RechargeInfo>
            <ars:AdditionalProperty>
               <arc:Code>CN_AU</arc:Code>
               <arc:Value>$au</arc:Value>
            </ars:AdditionalProperty>
            <ars:AdditionalProperty>
               <arc:Code>CN_CHARGE_TYPE</arc:Code>
               <arc:Value>$paymentType</arc:Value>
            </ars:AdditionalProperty>
            <ars:AdditionalProperty>
               <arc:Code>CN_CALLER_ID</arc:Code>
               <arc:Value>$callerID</arc:Value>
            </ars:AdditionalProperty>
            <ars:AdditionalProperty>
               <arc:Code>CN_VC_TYPE</arc:Code>
               <arc:Value>$voucherType</arc:Value>
            </ars:AdditionalProperty>
            <ars:AdditionalProperty>
               <arc:Code>C_CELLID</arc:Code>
               <arc:Value>$location</arc:Value>
            </ars:AdditionalProperty>
            <ars:AdditionalProperty>
               <arc:Code>CN_VC_SN</arc:Code>
               <arc:Value>$serialNumber</arc:Value>
            </ars:AdditionalProperty>
         </RechargeRequest>
      </ars:RechargeRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>